<script>
import breadCrumbs from "../../components/ui/breadCrumbs.vue";
import NavBar from "../../components/ui/navBar.vue";
export default {
    components: { breadCrumbs, NavBar },
    data() {
        return {
            news_detail: {},
            navbar: {
                title: "Новости",
                list: [
                    {
                        title: "Об утверждении Правил пользования системами водоснабжения и водоотведения населенных пунктов",
                        created_at: "20/08/2021",
                        views: 20,
                        id: 1,
                    },
                    {
                        title: "Об утверждении Правил пользования системами водоснабжения и водоотведения населенных пунктов",
                        created_at: "22/08/2021",
                        views: 15,
                        id: 2,
                    },
                    {
                        title: "Об утверждении Правил пользования системами водоснабжения и водоотведения населенных пунктов",
                        created_at: "01/08/2021",
                        views: 9,
                        id: 3,
                    },
                    {
                        title: "Об утверждении Правил пользования системами водоснабжения и водоотведения населенных пунктов",
                        created_at: "15/08/2021",
                        views: 12,
                        id: 4,
                    },
                    {
                        title: "Об утверждении Правил пользования системами водоснабжения и водоотведения населенных пунктов",
                        created_at: "22/08/2021",
                        views: 15,
                        id: 5,
                    },
                    {
                        title: "Об утверждении Правил пользования системами водоснабжения и водоотведения населенных пунктов",
                        created_at: "01/08/2021",
                        views: 9,
                        id: 6,
                    },
                    {
                        title: "Об утверждении Правил пользования системами водоснабжения и водоотведения населенных пунктов",
                        created_at: "15/08/2021",
                        views: 12,
                        id: 7,
                    },
                ],
            },
        };
    },
    created() {
        if (process.client) {
            this.news_detail = JSON.parse(localStorage.getItem("news-detail"));
        }
    },
    computed: {
        links() {
            return [
                {
                    title: "Главная",
                    url: "/",
                },
                {
                    title: "Новости",
                    url: "/news",
                },
                {
                    title: `${
                        this.news_detail.title
                            ? this.news_detail.title
                            : "Новость"
                    }`,
                    url: `/news/${this.news_detail.id}`,
                },
            ];
        },
    },
};
</script>

<template>
    <main class="news-details py">
        <div class="news-details__container main-container">
            <bread-crumbs :links="links" />
            <div class="news-details__content mt-14 d-flex">
                <nav-bar :navbar="navbar" />
                <div class="content-info">
                    <img src="@/assets/images/News/news_img.png" />
                    <h3>
                        ЭКОНОМИЯ ВОДЫ - ОДНО ИЗ НАПРАВЛЕНИЙ
                        ЭНЕРГОРЕСУРСОСБЕРЕЖЕНИЯ
                    </h3>
                    <p>
                        Л.В. Макотрина, А.А. Иевлева<br /><br />
                        Рассмотрены основные положения раздела
                        «Энергоресурсосбережение» СП 30.13330.2012
                        актуализированной редакции СНиП 2.04.01-85* «Внутренний
                        водопровод и канализация зданий». Перечислены основные
                        направления повышения энергоэффективности систем
                        водоснабжения. Описаны различные варианты снижения
                        расхода питьевой воды, в том числе наиболее
                        распространенные технические мероприятия. Для экономии
                        воды в домашних условиях предложены полезные советы<br /><br />
                        Ключевые слова: системы водоснабжения, внутренний
                        водопровод, энергоэффективность, санитарно-технические
                        приборы, энергоресурсосбережение.<br /><br />
                        WATER ECONOMY - ONE OF THE DIRECTIONS OF SAVING ENERGY
                        SUPPLY <br /><br />L.V. Makotrina, A.A. Ievleva
                        <br /><br />We considered the main statements of the
                        section "Saving Energy Supply" СП 30.13330.2012 of the
                        current edit СНиП 2.04.01-85* "Inner water pipe and soil
                        stack installation". The main directions of increasing
                        energy effectiveness of water supply systems. We
                        described different ways of reducing the costs for
                        drinking water, as well as the most widespread technical
                        materials.<br /><br />
                        Key words: water supply systems, inner water pipe,
                        energy efficiency, sanitary and technical equipment,
                        saving energy supply. <br /><br />В настоящее время
                        создан нормативно-правовой фундамент, позволяющий
                        осуществлять политику энергоресурсосбережения. Основным
                        документом в этом направлении является Федеральный закон
                        об энергосбережении № 261 «Об энергосбережении и о
                        повышении энергетической эффективности» принятый 11
                        ноября 2009 г. [1].<br /><br />
                        В целях улучшения работ по ресурсосбережению при
                        производстве и предоставлении жилищно-коммунальных услуг
                        разработаны «Основные направления и механизм
                        энергоресурсосбережения в жилищно-коммунальном
                        хозяйстве». Они включают мероприятия по утеплению
                        ограждающих конструкций здания, оборудованию приборами
                        учета, установке автоматизированных тепловых узлов с
                        погодным регулированием, реконструкцию существующих
                        источников тепла.<br /><br />
                        На основе этого документа во всех субъектах Российской
                        Федерации разработаны региональные программы
                        энергоресурсосбережения в жилищно-коммунальном
                        хозяйстве, в которых предложены экономические механизмы
                        энергосберегающих мероприятий за счет собственных
                        средств регионов. <br /><br />Целью закона является
                        создание правовых, экономических и организационных основ
                        стимулирования энергосбережения и повышения
                        энергетической эффективности. <br /><br />Положения,
                        установленные в отношении энергетических ресурсов,
                        применяются и в отношении воды, подаваемой,
                        передаваемой, потребляемой с использованием систем
                        централизованного водоснабжения.<br /><br />
                        СНиП 2.04.01-85* «Внутренний водопровод и канализация
                        зданий» (как и другие СНиПы систем водоснабжения и
                        водоотведения) не пересматривался и не обновлялся более
                        15 лет. Это привело к тому, что многие положения СНиПа
                        не соответствовали современному уровню инженерных
                        реалий. Простым примером является применение в проектах
                        энергосберегающих насосов и арматуры. С точки зрения
                        старых норм основная масса энергосберегающих решений
                        приводит к удорожанию системы, а значит применение
                        данного оборудования нежелательно. В то же время
                        понятно, что первичные капиталовложения окупятся при
                        эксплуатации здания и что применение нового оборудования
                        выгодно. Очевидно, что устаревшие нормы не могут быть
                        введены в действие без их переработки [2, 3, 6].
                    </p>
                </div>
            </div>
        </div>
    </main>
</template>


<style lang="scss" scoped>
.news-details {
    &__container {
        display: flex;
        flex-direction: column;
    }
    &__content {
        .content-info {
            max-width: 828px;
            width: 100%;

            img {
                width: 100%;
                max-height: 235px;
                height: auto;
                object-fit: cover;
                border-radius: 3px;
            }

            h3 {
                font-family: "SerifPro-Semibold";
                font-style: normal;
                font-weight: 600;
                font-size: 16px;
                line-height: 20px;
                letter-spacing: 0.1em;
                color: #000000;
                margin: 55px 0 18px;
            }
            p {
                font-family: "SerifPro-Regular";
                font-style: normal;
                font-weight: 400;
                font-size: 16px;
                line-height: 20px;
                color: #2e2e2e;
            }
        }
    }
}
</style>